export interface Vacancy {
  id: number;
  position: string;
  positionDisplay: string;
  role: string;
  contract: string;
  location: string;
  descriptionShort: string;
  description: string;
}

export const vacancies: Vacancy[] = [
  {
    id: 1,
    position: "Frontend",
    positionDisplay: "Frontend",
    role: "Dev",
    contract: "Full-Time",
    location: "Удаленно",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description:
      "Чем предстоит заниматься: — Проектирование пользовательской логики и сценариев для городских сервисов (ЖКХ, транспорт, медицина, афиша и др.); — Разработка пользовательских решений для сложных жизненных сценариев (оплата, обращения, статусы услуг); — Дизайн интерфейсов веб-приложений с нативным интерфейсом (адаптивных веб-приложений) в Фигма; — Создание графических элементов в рамках продукта: иконки, иллюстрации, заглушки, баннеры; — Формирование и поддержка базовой дизайн‑системы (Библиотека компонентов: кнопки, отступы, шрифты, стили); — Взаимодействие с разработчиками для обеспечения удобства и скорости вёрстки; — Участие в первичных проверках интерфейсов (коридорные тестирования — при наличии).  Какие знания и навыки необходимы: — Опыт работы дизайнером в веб‑ или мобильных продуктах от 1,5–2 лет (Джуниор+/Миддл); — Уверенное владение Фигма (компоненты, авто-раскладка, стили); — Базовое владение Иллюстратором / Фотошопом; — Понимание принципов адаптивного дизайна и особенностей веб-приложений с нативным интерфейсом; — Умение работать со сложными данными и упрощать их до понятных пользовательских решений; — Ориентация на пользовательский опыт, а не только визуальную составляющую.  Будет преимуществом: — Опыт работы с государственными или муниципальными сервисами, финтехом, электронная коммерция или агрегаторами; — Опыт проведения базовых коридорных тестирований (проверить макет на коллегах перед передачей в разработку).  Мы с удовольствием предложим тебе: — Официальное оформление с 1 дня работы; — График работы: 5/2 (сб, вск — выходной день) с 09:00 до 18:00; — Бесплатный Интернет и телевидение; — Спортивно-оздоровительные мероприятия (волейбол, футбол, бокс); — Скидки от наших партнёров: на доставку еды, фитнес и прочее; — Повышение своих компетенций в нашей корпоративной Академии; — Собственную корпоративную библиотеку для сотрудников. ",
  },
  {
    id: 2,
    position: "Backend",
    positionDisplay: "Backend",
    role: "Dev",
    contract: "Full-time",
    location: "Москва",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 3,
    position: "ML",
    positionDisplay: "ML",
    role: "Data",
    contract: "Full-time",
    location: "Нальчик",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 4,
    position: "Design",
    positionDisplay: "UX/UI-дизайнер",
    role: "Designer",
    contract: "Part-time",
    location: "Удаленно",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 5,
    position: "Design",
    positionDisplay: "UX/UI-дизайнер",
    role: "Designer",
    contract: "Part-time",
    location: "Москва",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 6,
    position: "Design",
    positionDisplay: "UX/UI-дизайнер",
    role: "Designer",
    contract: "Part-time",
    location: "Москва",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 7,
    position: "Frontend",
    positionDisplay: "Frontend",
    role: "Dev",
    contract: "Full-Time",
    location: "Удаленно",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description:
      "Чем предстоит заниматься: — Проектирование пользовательской логики и сценариев для городских сервисов (ЖКХ, транспорт, медицина, афиша и др.); — Разработка пользовательских решений для сложных жизненных сценариев (оплата, обращения, статусы услуг); — Дизайн интерфейсов веб-приложений с нативным интерфейсом (адаптивных веб-приложений) в Фигма; — Создание графических элементов в рамках продукта: иконки, иллюстрации, заглушки, баннеры; — Формирование и поддержка базовой дизайн‑системы (Библиотека компонентов: кнопки, отступы, шрифты, стили); — Взаимодействие с разработчиками для обеспечения удобства и скорости вёрстки; — Участие в первичных проверках интерфейсов (коридорные тестирования — при наличии).  Какие знания и навыки необходимы: — Опыт работы дизайнером в веб‑ или мобильных продуктах от 1,5–2 лет (Джуниор+/Миддл); — Уверенное владение Фигма (компоненты, авто-раскладка, стили); — Базовое владение Иллюстратором / Фотошопом; — Понимание принципов адаптивного дизайна и особенностей веб-приложений с нативным интерфейсом; — Умение работать со сложными данными и упрощать их до понятных пользовательских решений; — Ориентация на пользовательский опыт, а не только визуальную составляющую.  Будет преимуществом: — Опыт работы с государственными или муниципальными сервисами, финтехом, электронная коммерция или агрегаторами; — Опыт проведения базовых коридорных тестирований (проверить макет на коллегах перед передачей в разработку).  Мы с удовольствием предложим тебе: — Официальное оформление с 1 дня работы; — График работы: 5/2 (сб, вск — выходной день) с 09:00 до 18:00; — Бесплатный Интернет и телевидение; — Спортивно-оздоровительные мероприятия (волейбол, футбол, бокс); — Скидки от наших партнёров: на доставку еды, фитнес и прочее; — Повышение своих компетенций в нашей корпоративной Академии; — Собственную корпоративную библиотеку для сотрудников. ",
  },
  {
    id: 8,
    position: "Backend",
    positionDisplay: "Backend",
    role: "Dev",
    contract: "Full-time",
    location: "Москва",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 9,
    position: "ML",
    positionDisplay: "ML",
    role: "Data",
    contract: "Full-time",
    location: "Нальчик",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 10,
    position: "Design",
    positionDisplay: "UX/UI-дизайнер",
    role: "Designer",
    contract: "Part-time",
    location: "Удаленно",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 11,
    position: "Design",
    positionDisplay: "UX/UI-дизайнер",
    role: "Designer",
    contract: "Part-time",
    location: "Москва",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 12,
    position: "Analytics",
    positionDisplay: "Аналитика",
    role: "Designer",
    contract: "Part-time",
    location: "Москва",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 13,
    position: "Analytics",
    positionDisplay: "Аналитика",
    role: "Designer",
    contract: "Part-time",
    location: "Москва",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 14,
    position: "Design",
    positionDisplay: "UX/UI-дизайнер",
    role: "Designer",
    contract: "Part-time",
    location: "Москва",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 15,
    position: "Design",
    positionDisplay: "UX/UI-дизайнер",
    role: "Designer",
    contract: "Part-time",
    location: "Москва",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 16,
    position: "ML",
    positionDisplay: "ML",
    role: "Data",
    contract: "Full-time",
    location: "Нальчик",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 17,
    position: "ML",
    positionDisplay: "ML",
    role: "Data",
    contract: "Full-time",
    location: "Нальчик",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 18,
    position: "ML",
    positionDisplay: "ML",
    role: "Data",
    contract: "Full-time",
    location: "Нальчик",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 19,
    position: "ML",
    positionDisplay: "ML",
    role: "Data",
    contract: "Full-time",
    location: "Нальчик",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 20,
    position: "ML",
    positionDisplay: "ML",
    role: "Data",
    contract: "Full-time",
    location: "Нальчик",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 21,
    position: "ML",
    positionDisplay: "ML",
    role: "Data",
    contract: "Full-time",
    location: "Нальчик",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 22,
    position: "ML",
    positionDisplay: "ML",
    role: "Data",
    contract: "Full-time",
    location: "Нальчик",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 23,
    position: "ML",
    positionDisplay: "ML",
    role: "Data",
    contract: "Full-time",
    location: "Нальчик",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 24,
    position: "ML",
    positionDisplay: "ML",
    role: "Data",
    contract: "Full-time",
    location: "Нальчик",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 25,
    position: "ML",
    positionDisplay: "ML",
    role: "Data",
    contract: "Full-time",
    location: "Нальчик",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 26,
    position: "ML",
    positionDisplay: "ML",
    role: "Data",
    contract: "Full-time",
    location: "Нальчик",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 27,
    position: "ML",
    positionDisplay: "ML",
    role: "Data",
    contract: "Full-time",
    location: "Нальчик",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 28,
    position: "ML",
    positionDisplay: "ML",
    role: "Data",
    contract: "Full-time",
    location: "Нальчик",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 29,
    position: "ML",
    positionDisplay: "ML",
    role: "Data",
    contract: "Full-time",
    location: "Нальчик",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 30,
    position: "ML",
    positionDisplay: "ML",
    role: "Data",
    contract: "Full-time",
    location: "Нальчик",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 31,
    position: "ML",
    positionDisplay: "ML",
    role: "Data",
    contract: "Full-time",
    location: "Нальчик",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 32,
    position: "ML",
    positionDisplay: "ML",
    role: "Data",
    contract: "Full-time",
    location: "Нальчик",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 33,
    position: "ML",
    positionDisplay: "ML",
    role: "Data",
    contract: "Full-time",
    location: "Нальчик",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 34,
    position: "ML",
    positionDisplay: "ML",
    role: "Data",
    contract: "Full-time",
    location: "Нальчик",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 35,
    position: "ML",
    positionDisplay: "ML",
    role: "Data",
    contract: "Full-time",
    location: "Нальчик",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 36,
    position: "ML",
    positionDisplay: "ML",
    role: "Data",
    contract: "Full-time",
    location: "Нальчик",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 37,
    position: "ML",
    positionDisplay: "ML",
    role: "Data",
    contract: "Full-time",
    location: "Нальчик",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 38,
    position: "ML",
    positionDisplay: "ML",
    role: "Data",
    contract: "Full-time",
    location: "Нальчик",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 39,
    position: "ML",
    positionDisplay: "ML",
    role: "Data",
    contract: "Full-time",
    location: "Нальчик",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 40,
    position: "ML",
    positionDisplay: "ML",
    role: "Data",
    contract: "Full-time",
    location: "Нальчик",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 41,
    position: "ML",
    positionDisplay: "ML",
    role: "Data",
    contract: "Full-time",
    location: "Нальчик",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 42,
    position: "ML",
    positionDisplay: "ML",
    role: "Data",
    contract: "Full-time",
    location: "Нальчик",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 43,
    position: "ML",
    positionDisplay: "ML",
    role: "Data",
    contract: "Full-time",
    location: "Нальчик",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 44,
    position: "ML",
    positionDisplay: "ML",
    role: "Data",
    contract: "Full-time",
    location: "Нальчик",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 35,
    position: "ML",
    positionDisplay: "ML",
    role: "Data",
    contract: "Full-time",
    location: "Нальчик",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
  {
    id: 46,
    position: "ML",
    positionDisplay: "ML",
    role: "Data",
    contract: "Full-time",
    location: "Нальчик",
    descriptionShort:
      "Описание вакансии в несколько строк Описание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строкОписание вакансии в несколько строк ",
    description: "",
  },
];
